# Задача №21.
# Напишите программу для печати всех уникальных значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
# Примечание: Список словарей задан изначально. Пользователь его не вводит.

m_dict = {"V": "S001", "V": "S002", "VI": "S001", "VI": "S005","VII": "S005 ", " V ":"S009 ", " VIII":"S007 "}
n_list = []
#m_list = set()
for i in m_dict:
    print(m_dict[i])
    n_list.append(m_dict[i])
    
print(n_list)