# Задача №21.
# Напишите программу для печати всех уникальных значений в словаре.
# Список словарей - Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}]
# Множество - Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
# Примечание: Список словарей задан изначально. Пользователь его не вводит.

m_dict =  [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, 
{"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}]

n_list = set()

for i in m_dict:
    for value in i.values():
        n_list.add(value.strip()) # strip() - удаление пробелов у значения, чтобы сопоставить уникальность
    
print(n_list)
print(*n_list)