# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы
# расплачивались за проезд и получали билет с номером. Счастливым
# билетом называют такой билет с шестизначным номером, где сумма
# первых трех цифр равна сумме последних трех. Т.е. билет с номером
# 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
# программу, которая проверяет счастливость билета.

numb = input('Введите шестизначный номе билета: ')
numb1 = int(numb)
n1 = numb1 // 1000
print(n1)
n2 = numb1 % 1000
print(n2)
sum1 = 0
sum2 = 0
while n1 > 0:
    sum1 += n1 % 10
    n1 //= 10
print(sum1)
while n2 > 0:
    sum2 += n2 % 10
    n2 //= 10
print(sum2)
if sum1 == sum2:
    print(f'{numb} -> yes')
else:
    print(f'{numb} -> no')